---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MechanicalUtils..::..ConnectDuctPlaceholdersAtElbow Method
MechanicalUtils Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ConnectDuctPlaceholdersAtElbow(Document, Connector, Connector) | Connects a pair of placeholders that can intersect in an Elbow connection. |
|  | ConnectDuctPlaceholdersAtElbow(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in an Elbow connection. |

# See Also

MechanicalUtils Class

MechanicalUtils Members

Autodesk.Revit.DB.Mechanical Namespace